---
kind: type
id: T:Autodesk.Revit.DB.PointNode
source: html/02661c46-c644-c4d8-2db2-11d9fb30b20e.htm
---
# Autodesk.Revit.DB.PointNode

An output node that represents a 3D point.

## Syntax (C#)
```csharp
public class PointNode : ModelCurveNode
```

## Remarks
See also: OnPoint(PointNode) .